### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# Files to Load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [2]:
#View first five himes of school data
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [3]:
#View first five himes of student data
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [4]:
# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [5]:
#View all columns in merged dataframe
school_data_complete.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [6]:
#Determine data types
school_data_complete.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [9]:
#Check for null values
school_data_complete.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
School ID        0
type             0
size             0
budget           0
dtype: int64

In [7]:
#Check for duplicate names
student_data[student_data.duplicated('student_name')].sort_values(['student_name']).head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
18279,18279,Aaron Evans,M,12th,Bailey High School,93,76
18153,18153,Aaron Gonzalez,M,11th,Bailey High School,81,60
38299,38299,Aaron Holmes,M,10th,Thomas High School,76,72
28906,28906,Aaron Johnson,M,9th,Rodriguez High School,94,62
13875,13875,Aaron Johnson,M,9th,Wilson High School,84,90

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [10]:
#Calculate the total number of schools
schoolCount = school_data['school_name'].nunique()
schoolCount

15

In [11]:
#Calculate the total number of students
studentCount = student_data['Student ID'].nunique()
studentCount

39170

In [12]:
#Calculate the total budget
districtBudget = school_data["budget"].sum()

In [13]:
#Calculate the average math score
avgMathScore = student_data['math_score'].mean()
avgMathScore

78.98537145774827

In [14]:
#Calculate the average reading score
avgReadScore = student_data['reading_score'].mean()
avgReadScore

81.87784018381414

In [15]:
#Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2
overallScore = (avgMathScore + avgReadScore)/2
overallScore

80.43160582078121

In [16]:
#Calculate the percentage of students with a passing math score (70 or greater)
passedMathCount = len(student_data[student_data['math_score'] >= 70])
perPassedMath = (passedMathCount/studentCount) * 100
perPassedMath

74.9808526933878

In [17]:
#Calculate the percentage of students with a passing reading score (70 or greater)
passedReadCount = len(student_data[student_data['reading_score'] >= 70])
perPassedRead = (passedReadCount/studentCount) * 100
perPassedRead

85.80546336482001

In [18]:
#Create a dataframe to hold the above results
districtSummDict = [{'Total Schools': schoolCount,
                    'Total Students': studentCount,
                    'Total Budget': districtBudget,
                    'Average Math Score': avgMathScore,
                    'Average Reading Score': avgReadScore,
                    '% Passing Math': perPassedMath,
                    '% Passing Reading': perPassedRead,
                    '% Overall Passing Rate': overallScore}]
districtSumm = pd.DataFrame(districtSummDict)
districtSumm.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.431606

In [19]:
#Optional: give the displayed data cleaner formatting
districtSumm['Total Schools'] = districtSumm['Total Schools'].map("{:,}".format)
districtSumm['Total Students'] = districtSumm['Total Students'].map("{:,}".format)  
districtSumm['Total Budget'] = districtSumm['Total Budget'].map("${:,}".format)
districtSumm['Average Math Score'] = districtSumm['Average Math Score'].map("{:.2f}".format)
districtSumm['Average Reading Score'] = districtSumm['Average Reading Score'].map("{:.2f}".format)
districtSumm['% Passing Math'] = districtSumm['% Passing Math'].map("{:.2f}%".format)
districtSumm['% Passing Reading'] = districtSumm['% Passing Reading'].map("{:.2f}%".format)
districtSumm['% Overall Passing Rate'] = districtSumm['% Overall Passing Rate'].map("{:.2f}%".format)
districtSumm.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170","$24,649,428",78.99,81.88,74.98%,85.81%,80.43%

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)
  
* Create a dataframe to hold the above results

In [20]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [21]:
#School Name
#indexedSchool = school_data_complete.set_index('school_name', inplace = True)
#indexedSchool

In [22]:
#Create 'School Type' column
schoolType = school_data.set_index(["school_name"])["type"]
schoolType

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [23]:
#Create 'Total Students' column
schoolSize = school_data.set_index(["school_name"])["size"]
schoolSize

school_name
Huang High School        2917
Figueroa High School     2949
Shelton High School      1761
Hernandez High School    4635
Griffin High School      1468
Wilson High School       2283
Cabrera High School      1858
Bailey High School       4976
Holden High School        427
Pena High School          962
Wright High School       1800
Rodriguez High School    3999
Johnson High School      4761
Ford High School         2739
Thomas High School       1635
Name: size, dtype: int64

In [24]:
#Total School Budget
schoolBudget = school_data.set_index(["school_name"])["budget"]
schoolBudget

school_name
Huang High School        1910635
Figueroa High School     1884411
Shelton High School      1056600
Hernandez High School    3022020
Griffin High School       917500
Wilson High School       1319574
Cabrera High School      1081356
Bailey High School       3124928
Holden High School        248087
Pena High School          585858
Wright High School       1049400
Rodriguez High School    2547363
Johnson High School      3094650
Ford High School         1763916
Thomas High School       1043130
Name: budget, dtype: int64

In [25]:
#Create 'Per Student Budget' column
budgetPerStudent = schoolBudget/schoolSize
budgetPerStudent

school_name
Huang High School        655.0
Figueroa High School     639.0
Shelton High School      600.0
Hernandez High School    652.0
Griffin High School      625.0
Wilson High School       578.0
Cabrera High School      582.0
Bailey High School       628.0
Holden High School       581.0
Pena High School         609.0
Wright High School       583.0
Rodriguez High School    637.0
Johnson High School      650.0
Ford High School         644.0
Thomas High School       638.0
dtype: float64

In [26]:
#Create 'Average Math Score' column
avgSchoolMathScore = school_data_complete.groupby(['school_name']).mean()['math_score']
avgSchoolMathScore

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [27]:
#Create 'Average Reading Score' column
avgSchoolReadScore = school_data_complete.groupby(['school_name']).mean()['reading_score']
avgSchoolReadScore

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [40]:
#Filter out students that passed math
passMathStudent = school_data_complete[school_data_complete['math_score']>=70]

#Group the above dataframe by School and count students for each school
passMathStudentCount = passMathStudent.groupby(['school_name']).count()['Student ID']

#Calculate the percentage of that passed math
perPassMath = (passMathStudentCount/schoolSize) * 100
perPassMath

school_name
Bailey High School       66.680064
Cabrera High School      94.133477
Figueroa High School     65.988471
Ford High School         68.309602
Griffin High School      93.392371
Hernandez High School    66.752967
Holden High School       92.505855
Huang High School        65.683922
Johnson High School      66.057551
Pena High School         94.594595
Rodriguez High School    66.366592
Shelton High School      93.867121
Thomas High School       93.272171
Wilson High School       93.867718
Wright High School       93.333333
dtype: float64

In [37]:
#Filter out students that passed reading
passReadStudent = school_data_complete[school_data_complete['reading_score']>=70]

#Group the above dataframe by School and count students for each school
passReadStudentCount = passReadStudent.groupby(['school_name']).count()['Student ID']

#Calculate the percentage of that passed math
perPassRead = (passReadStudentCount/schoolSize) * 100
perPassRead

school_name
Bailey High School       81.933280
Cabrera High School      97.039828
Figueroa High School     80.739234
Ford High School         79.299014
Griffin High School      97.138965
Hernandez High School    80.862999
Holden High School       96.252927
Huang High School        81.316421
Johnson High School      81.222432
Pena High School         95.945946
Rodriguez High School    80.220055
Shelton High School      95.854628
Thomas High School       97.308869
Wilson High School       96.539641
Wright High School       96.611111
dtype: float64

In [38]:
#Overall Passing Rate (Average of the above two)
overallPassingRate = (perPassMath + perPassRead) / 2
overallPassingRate

school_name
Bailey High School       74.306672
Cabrera High School      95.586652
Figueroa High School     73.363852
Ford High School         73.804308
Griffin High School      95.265668
Hernandez High School    73.807983
Holden High School       94.379391
Huang High School        73.500171
Johnson High School      73.639992
Pena High School         95.270270
Rodriguez High School    73.293323
Shelton High School      94.860875
Thomas High School       95.290520
Wilson High School       95.203679
Wright High School       94.972222
dtype: float64

In [41]:
#Create a dataframe to hold the above results
schoolSummDict = {'School Type': schoolType,
                  'Total Students': schoolSize,
                  'Total School Budget': schoolBudget,
                  'Per Student Budget': budgetPerStudent,
                  'Average Math Score': avgSchoolMathScore,
                  'Average Reading Score': avgSchoolReadScore,
                  '% Passing Math': perPassMath,
                  '% Passing Reading': perPassRead,
                  '% Overall Passing Rate': overallPassingRate}
schoolSumm = pd.DataFrame(schoolSummDict)
schoolSumm.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,74.306672
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,95.586652
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,73.363852
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,73.804308
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,95.265668

## Top Performing Schools (By Passing Rate)

* Sort and display the top five schools in overall passing rate

In [45]:
schoolSumm.sort_values('% Overall Passing Rate',ascending = False).head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,95.586652
Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,93.272171,97.308869,95.290520
Pena High School,Charter,962,585858,609.0,83.839917,84.044699,94.594595,95.945946,95.270270
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,95.265668
Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,93.867718,96.539641,95.203679

## Bottom Performing Schools (By Passing Rate)

* Sort and display the five worst-performing schools

In [46]:
schoolSumm.sort_values('% Overall Passing Rate').head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,66.366592,80.220055,73.293323
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,73.363852
Huang High School,District,2917,1910635,655.0,76.629414,81.182722,65.683922,81.316421,73.500171
Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,66.057551,81.222432,73.639992
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,73.804308

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [ ]:
#Create a pandas series for each grade. Hint: use a conditional statement.

In [ ]:
#Group each series by school

In [ ]:
#Combine the series into a dataframe

In [ ]:
#Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [34]:
# Sample bins. Feel free to create your own bins.
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

## Scores by School Size

* Perform the same operations as above, based on school size.

In [35]:
# Sample bins. Feel free to create your own bins.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

## Scores by School Type

* Perform the same operations as above, based on school type.